{
    "workflow": {
        "title": "Email Investigation Workflow",
        "shortcut": "email",
        "input_parameters": [
            {
                "name": "sender_email_address",
                "description": "The email address of the sender to be investigated."
            },
            {
                "name": "subject_keyword",
                "description": "A keyword from the email subject to filter the emails."
            }
        ],
        "tasks": [
            {
                "title": "Obtain Email Details",
                "plugin_name": "SentinelKQLPlugin",
                "capability_name": "generateandrunkql",
                "prompt_text": "Retrieve email details from Microsoft Sentinel using the sender email address {{sender_email_address}} and subject keyword {{subject_keyword}}. Make sure you include the Recipient address and the InternetMessageId in the query results. Limit the results to the most recent email (1)."
            },
            {
                "title": "Extract Email Data",
                "plugin_name": "GraphAPIPlugin",
                "capability_name": "getemaildetails",
                "prompt_text": "Retrieve the Body and headers of the email listed in the previous step. You must use the recipient email address and the InternetMessageId from the results above. Make sure you also extract a list of URLs, IP addresses and Domains from the email body and headers."
            },

            {
                "parallel_tasks": [
                    {
                        "title": "Analyze Email Content",
                        "plugin_name": "GPTPlugin",
                        "capability_name": "runprompt",
                        "prompt_text": "Run an analysis of the content of the email above for suspicious links, attatchments, and keywords."
                    },
                    {
                        "title": "Analyze Email Headers",
                        "plugin_name": "GPTPlugin",
                        "capability_name": "runprompt",
                        "prompt_text": "Run an analysis of the Headers of the email above for suspicious email authentication details."
                    },
                    {
                        "title": "Investigate Associated Domains",
                        "plugin_name": "SentinelKQLPlugin",
                        "capability_name": "InvestigateDomainListThreatIntelligence",
                        "prompt_text": "Extract the domains present in the analyzaed email body and headers and investigate them for any threat intelligence indicators."
                    },
                    {
                        "title": "Investigate Associated IP Addresses",
                        "plugin_name": "SentinelKQLPlugin",
                        "capability_name": "InvestigateIPListThreatIntelligence",
                        "prompt_text": "Extract the IP addresses present in the analyzaed email body and headers and investigate them for any threat intelligence indicators."
                    }
                ]
            },
            {
                "title": "Render Email",
                "plugin_name": "GPTPlugin",
                "capability_name": "runprompt",
                "prompt_text": "Render the body of the email as HTML, mimicking the appearance of the email in Microsoft Outlook. Ensure the email content is formatted and laid out as it would appear to the recipient in Outlook. Include the necessary headers and metadata.Also include the CSS styles and images in the email body."
            },
            {
                "title": "Generate Investigation Report",
                "plugin_name": "GPTPlugin",
                "capability_name": "runprompt",
                "prompt_text": "Generate a detailed report of the findings from the email investigation. INclude the Findings from the email content analysis, email headers analysis, domain and IP address investigation, and any other relevant details. Make sure you create a well-structured and formatted report with clear headings and sections. You must include a Conclusion section that states your classification of the email as benign, Suspicous or malicious and the recommended next steps."
            }
        ]
    }
}